In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [2]:
data = Series(['Abj','Kogi','Nas',np.nan,'Benue','Kat',])
data

0      Abj
1     Kogi
2      Nas
3      NaN
4    Benue
5      Kat
dtype: object

In [3]:
data.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [4]:
data.dropna()

0      Abj
1     Kogi
2      Nas
4    Benue
5      Kat
dtype: object

In [5]:
dframe = DataFrame([[1,2,3,np.nan],[4,5,6,np.nan],[7,11,np.nan,12]])
dframe

   0   1    2     3
0  1   2  3.0   NaN
1  4   5  6.0   NaN
2  7  11  NaN  12.0

In [6]:
cleanDframe= dframe.dropna()
cleanDframe

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [7]:
 dframe.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [8]:
dframe.dropna(how= 'all')

   0   1    2     3
0  1   2  3.0   NaN
1  4   5  6.0   NaN
2  7  11  NaN  12.0

In [10]:
dframe2= DataFrame([[np.nan,3,4],[5,np.nan,6],[7,8,np.nan]])
dframe2

     0    1    2
0  NaN  3.0  4.0
1  5.0  NaN  6.0
2  7.0  8.0  NaN

In [13]:
dframe2.dropna(thresh=2)

     0    1    2
0  NaN  3.0  4.0
1  5.0  NaN  6.0
2  7.0  8.0  NaN

In [14]:
dframe2.fillna(4)

     0    1    2
0  4.0  3.0  4.0
1  5.0  4.0  6.0
2  7.0  8.0  4.0